app/controllers/tasks_controller.rb

  def create
    @task = Task.create(task_params)

    if @task.save
---
INSERT INTO "tasks" ("title", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "learn ruby "], ["done", nil], ["todo_id", 6], ["created_at", "2023-12-04 07:09:10.592160"], ["updated_at", "2023-12-04 07:09:10.592160"]]
INSERT INTO "tasks" ("title", "done", "todo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "catch up"], ["done", 0], ["todo_id", 4], ["created_at", "2023-12-04 04:41:17.339524"], ["updated_at", "2023-12-04 04:41:17.339524"]]

  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "done" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["done", 1], ["updated_at", "2023-12-04 07:04:27.194535"], ["id", 1]]