app/controllers/todos_controller.rb

INSERT INTO "todos" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "testing 123"], ["created_at", "2023-12-04 04:08:32.802895"], ["updated_at", "2023-12-04 04:08:32.802895"]]
---
  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save

UPDATE "todos" SET "name" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["name", "steven"], ["updated_at", "2023-12-04 04:27:04.804477"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
---
  def destroy
    @todo.destroy!